app/Models/UsuarioModel.php

SELECT *
FROM `usuario`
WHERE `emailUsuario` = 'admin@mail.com'
 LIMIT 1
---
    public function verificarLogin($email, $password)
    {
        $usuario = $this->where('emailUsuario', $email)
            ->first();