app/Models/VehiculoModel.php

    public function mostrarVehiculosDisponibles(){
        return $this->where('activoVehiculo', 1)->where('disponibleVehiculo', 1)->findAll();
---
SELECT *
FROM `vehiculo`
WHERE `activoVehiculo` = 1
AND `disponibleVehiculo` = 1